{
  "home_title": "Komunika",
  "home_header": "Pagbuwag ng Hadlang, \nPagkonekta ng Puso.",
  "home_tips1": "📱 Siguraduhing matatag ang iyong koneksyon sa internet – Ang ilang tampok ay nangangailangan ng internet para sa pinakamahusay na pagganap.",
  "home_tips2": "🎙️ Magsalita nang malinaw at sa tamang bilis – Nakakatulong ito upang mapabuti ang katumpakan ng speech-to-text.",
  "home_tips3": "🔋 Panatilihing naka-charge ang iyong device – Ang paggamit ng speech at transcription services ay maaaring mabilis magpababa ng baterya.",
  "home_tips4": "🗣️ Iwasan ang ingay sa paligid – Mas tumpak ang transcription sa tahimik na kapaligiran.",
  "home_tips5": "🎤 Ilagay nang tama ang mikropono – Ilapit ang mikropono ng telepono para sa mas malinaw na pagsasalin.",
  "home_tips6": "⏳ Maghintay saglit sa pagitan ng mga pangungusap – Nakakatulong ito upang maiwasan ang pagsasama-sama ng mga salita sa transcription.",
  "home_tips7": "✍️ Gumamit ng tamang bantas – Ang mga kuwit at tuldok ay nagpapahusay sa daloy ng pagsasalita.",
  "home_tips8": "🏆 Subukan ang iba't ibang boses – I-customize ang iyong pakikinig sa pamamagitan ng pagpapalit ng boses.",
  "home_tips9": "📷 Siguraduhing may sapat na ilaw – Ang tamang liwanag ay nagpapahusay sa katumpakan ng pagkilala.",
  "home_tips10": "🤟 Gumamit ng malinaw na kilos ng kamay – Mas madaling naiintindihan ng system kung malinaw at buo ang kilos.",
  "home_tips11": "📺 Panatilihing nakikita ang mga caption – Ilagay ang mga ito sa lugar na hindi natatakpan ang mahahalagang bahagi ng screen.",
  "home_tips12": "🛠️ I-adjust ang laki ng font sa caption – Baguhin ang mga setting upang mapadali ang pagbasa.",
  "home_tips13": "⏩ I-save ang madalas gamitin na mga parirala – Mag-imbak ng mga pahayag para sa mas mabilis na komunikasyon.",
  "home_tips14": "💬 Gumamit ng emojis at shortcut – Nakakatulong ito upang gawing mas epektibo at makulay ang pakikipag-usap.",
  "home_sound_enhancer": "Pampalinaw ng Tunog",
  "home_text_to_speech": "Teksto sa Boses",
  "home_quick_speech": "Quick Speech",
  "home_no_quick_speech": "Walang available",
  "home_speech_to_text_description": "I-tap dito upang subukan ang pagsasalita sa teksto na kakayahan",
  "home_text_to_speech_description": "I-tap dito upang subukan ang teksto sa pagsasalita na kakayahan",

  "history_speech_to_text_title": "Historya",
  "history_text_to_speech_title": "Historya",
  "history_no_title": "Walang Pamagat",
  "history_no_history": "Walang Historya ng transkripsyon.",
  "history_edit_title": "I-edit ang Pamagat",
  "history_enter_new_title": "Ilagay ang bagong pamagat",
  "history_cancel": "Kanselahin",
  "history_save": "I-save",
  "history_edit": "I-edit",
  "history_delete": "Tanggalin",

  "sound_enhancer_title": "Pampalinaw ng Tunog",
  "sound_enhancer_visualization": "Pagpapakita ng Tunog",
  "sound_enhancer_amplifier_off": "Sarado",
  "sound_enhancer_amplifier_on": "Headphones Mikropono",
  "sound_enhancer_amplifier_warning_title": "Kinakailangan ang Headphones",
  "sound_enhancer_amplifier_warning_content": "Ikonekta ang Headphones upang magamit ang mga tampok ng pagpapahusay ng mikropono",
  "sound_enhancer_amplifier_connected": "Piliin ang 'Headphones Mikropono' upang paganahin ang mga tampok ng sound enhancement",
  "sound_enhancer_amplifier_disconnected": "Ikonekta ang Headphones upang magamit ang mga tampok ng pagpapahusay ng mikropono",
  "sound_enhancer_amplifier_noise_reduction": "Pagbawas ng Ingay",
  "sound_enhancer_amplifier_noise_reduction_level": "Antas ng Pagbawas ng Ingay",
  "sound_enhancer_amplifier_amplifier_level": "Antas ng Amplifier",
  "sound_enhancer_amplifier_audio_balance": "Balanse ng Audio",
  "sound_enhancer_transcription": "Transkripsyon",
  "sound_enhancer_transcription_hint": "Mensahe...",
  "sound_enhancer_transcription_translated_text": "Isinaling Teksto",
  "server_not_connected": "Hindi Nakakonekta ang Server",
  "server_not_connected_message": "Hindi makakonekta sa transcription server. Pakisuri ang iyong koneksyon sa internet at subukan muli.",
  "reconnect": "Muling Konektahin",

  "tts_title": "Teksto sa Boses",
  "tts_hint1": "Pamagat",
  "tts_hint2": "Mag-type ng Anuman...",
  "tts_hint_empty": "Walang laman ang Text Field.",
  "tts_image_processing_title": "Pagproseso ng Imahe",
  "tts_select_source": "Pumili ng Pinagmulan ng Imahe",
  "tts_camera": "Kunan ng Larawan",
  "tts_gallery": "Pumili mula sa Gallery",
  "tts_image_preview": "Preview ng Imahe",
  "tts_processing_image": "Pinoproseso ang Imahe",
  "tts_extracting_text": "Kinukuha ang teksto...",
  "tts_batch_process_title": "Proseso ng Maramihang Imahe",
  "tts_batch_process_message": "Proseso ng {count} na mga imahe?",
  "tts_processing_batch": "Pinoproseso ang Batch",
  "tts_processing_image_count": "Imahe {current} ng {total}",
  "tts_cancel": "Kanselahin",
  "tts_proceed": "Magpatuloy",
  "tts_process": "Proseso ng Teksto",

  "save_confirmation_title": "I-save sa Historya",
  "save_confirmation_message": "Nais mo bang i-save ang tekstong ito sa iyong Historya?",

  "settings_title": "Settings",
  "settings_customization": "Pagpapasadya",
  "settings_theme": "Tema",
  "settings_language": "Wika",
  "settings_history": "Historya",
  "settings_speech_to_text": "Pagsasalita tungo sa Teksto",
  "settings_text_to_speech": "Teksto tungo sa Pagsasalita",
  "settings_help_support": "Tulong at Suporta",
  "settings_terms_and_conditions": "Mga Tuntunin at Kundisyon",
  "settings_faq": "Mga Madalas Itanong",
  "settings_about": "Tungkol sa Amin",
  "settings_update_available": "May Bagong Bersyon na Magagamit",
  "settings_update": "I-update",

  "terms_title": "Mga Tuntunin at Kondisyon",
  "terms_welcome_title": "Maligayang Pagdating sa Komunika",
  "terms_welcome_content": "Ang Komunika ay isang mobile application na idinisenyo upang suportahan ang mga indibidwal na may kapansanan sa pandinig sa pamamagitan ng pagbibigay ng mga feature ng hearing aid system at text-to-speech functionality. Sa paggamit ng Komunika, sumasang-ayon ka sa mga sumusunod na Tuntunin at Kondisyon.",
  "terms_acceptance_title": "Pagtanggap sa mga Tuntunin",
  "terms_acceptance_content": "Sa pag-download, pag-install, o paggamit ng Komunika, kinikilala mo na nabasa, naintindihan, at sumang-ayon kang mapailalim sa mga Tuntunin at Kondisyong ito.",
  "terms_purpose_title": "Layunin ng Application",
  "terms_purpose_content": "Ang Komunika ay idinisenyo upang tulungan ang mga user na may kapansanan sa pandinig sa pamamagitan ng:\n• Pagpapalakas at pagpapahusay ng mga tunog (hearing aid system)\n• Pag-convert ng sinasalitang mga salita sa nakasulat na teksto (speech-to-text)\n• Pag-convert ng nakasulat na teksto sa sinasalitang mga salita (text-to-speech)\n\n⚠️ **Paalala**: Ang Komunika ay hindi kapalit ng propesyonal na payo medikal, diagnosis, o paggamot.",
  "terms_responsibilities_title": "Mga Pananagutan ng User",
  "terms_responsibilities_content": "• Gamitin ang Komunika para lamang sa mga lehitimong layunin.\n• Siguraduhing mayroon ang iyong device ng kinakailangang hardware (microphone, speaker, headphones).\n• Huwag abusuhin, i-hack, o samantalahin ang app.",
  "terms_privacy_title": "Privacy at Data",
  "terms_privacy_content": "Maaaring iproseso ng Komunika ang audio input at text data para sa mga layuning pang-functionality. Hindi namin ibinebenta o ibinabahagi ang personal na data sa mga third party nang walang iyong pahintulot.",
  "terms_property_title": "Intellectual Property",
  "terms_property_content": "Ang lahat ng content, feature, at functionality sa Komunika (kabilang ang software, disenyo, at logo) ay pag-aari ng Komunika team.",
  "terms_liability_title": "Limitasyon ng Pananagutan",
  "terms_liability_content": "Ang Komunika ay ibinibigay sa batayang \"as-is\" at \"as-available\". Hindi namin ginagarantiyahan ang walang patid o walang error na operasyon at hindi mananagot sa mga pinsalang dulot ng paggamit o kawalan ng kakayahang gamitin ang app.",
  "terms_updates_title": "Mga Update at Pagbabago",
  "terms_updates_content": "Maaari naming i-update o baguhin ang Komunika anumang oras. Ang patuloy na paggamit pagkatapos ng mga update ay nangangahulugang tinatanggap mo ang mga bagong tuntunin.",
  "terms_termination_title": "Pagwawakas",
  "terms_termination_content": "Itinatabi namin ang karapatang suspindihin o wakasan ang access kung lalabagin mo ang mga Tuntuning ito.",
  "terms_contact_title": "Makipag-ugnayan sa Amin",
  "terms_contact_content": "Para sa mga katanungan, feedback, o alalahanin, mag-email sa amin sa:",
  "terms_contact_email": "komunika.up@gmail.com",

  "about_title": "Tungkol sa Amin",
  "about_version": "Bersyon",
  "about_project_team": "Koponan ng Proyekto",
  "lead_developer": "Punong Developer",
  "ui_ux_designer": "UI/UX Designer",
  "frontend_developer": "Frontend Developer",
  "backend_developer": "Backend Developer",
  "full_stack_developer": "Full Stack Developer",
  "about_follow_us": "Sundan Kami",

  "faq_title": "Mga Madalas Itanong",
  "faq_description": "Mga Madalas na Katanungan tungkol sa Komunika",

  "faq_question1": "Ano ang Komunika?",
  "faq_answer1": "Ang Komunika ay isang mobile app na tumutulong sa mga taong may kapansanan sa pandinig sa pamamagitan ng mga tampok gaya ng Sound Enhancer, Speech-to-Text, at Text-to-Speech.",

  "faq_question2": "Paano gamitin ang Komunika?",
  "faq_answer2": "Buksan ang app at pumili mula sa mga pangunahing tampok: gamitin ang Sound Enhancer para mas malinaw na marinig, Speech-to-Text para sa real-time na transkripsyon, o Text-to-Speech para ipabasa ang iyong teksto.",

  "faq_question3": "Kailangan ba ng internet para gumana ang Komunika?",
  "faq_answer3": "Hindi lahat. Ang ilang tampok tulad ng Sound Enhancer at Text-to-Speech ay gumagana offline, ngunit ang ibang bahagi gaya ng Speech-to-Text ay maaaring mangailangan ng internet.",

  "faq_question4": "Ano ang tampok na Sound Enhancer?",
  "faq_answer4": "Ang Sound Enhancer ay nagpapalinaw ng tunog at binabawasan ang ingay sa paligid. Maaari mong ayusin ang balanse ng audio, antas ng amplifier, at noise reduction.",

  "faq_question5": "Ano ang Speech-to-Text?",
  "faq_answer5": "Binabago ng Speech-to-Text ang mga sinasalitang salita upang maging nakasulat na teksto. Mainam ito para sa real-time na komunikasyon o pagtatala ng impormasyon.",

  "faq_question6": "Ano ang Text-to-Speech?",
  "faq_answer6": "Ang Text-to-Speech ay binabasa nang malakas ang iyong teksto. Maaari kang mag-type o mag-paste ng mensahe at ipabasa ito ng app gamit ang boses.",

  "faq_question7": "Maaari bang i-save ang mga transkripsyon o teksto?",
  "faq_answer7": "Oo. Maaari mong i-save ang mga transkripsyon at text-to-speech history sa app upang madaling balikan.",

  "faq_question8": "Maaari ko bang baguhin ang tema at wika?",
  "faq_answer8": "Oo. Sinusuportahan ng Komunika ang Light Mode, Dark Mode, at System Theme. Maaari ka ring pumili ng English o Filipino na wika.",

  "faq_question9": "Ligtas ba ang aking data?",
  "faq_answer9": "Oo. Ang Komunika ay hindi nagbebenta o nagbabahagi ng iyong personal na data sa mga third party. Ang mga input mo ay ginagamit lamang para sa functionality ng app.",

  "faq_question10": "Paano makipag-ugnayan para sa suporta?",
  "faq_answer10": "Maaari kang magpadala ng email sa komunika.up@gmail.com para sa mga tanong, feedback, o suporta."
}
